app/controllers/groups_controller.rb

 def show
   @group = Group.find(params[:id])
---
SELECT * FROM "groups" WHERE ("groups"."id" = 1)

 def index
    @groups = Group.all
---
SELECT * FROM "groups"