app/controllers/people_controller.rb

  def edit
    @person = Person.find(params[:id])
    @groups = Group.all
---
SELECT * FROM "groups"

  def update
    #params[:person][:group_ids] ||= []

    @person = Person.find(params[:id])

    if @person.update_attributes(params[:person])
      @person.group_ids = params[:person][:group_ids]
---
SELECT "groups".id FROM "groups" INNER JOIN "groups_people" ON "groups".id = "groups_people".group_id WHERE ("groups"."id" = 1) AND ("groups_people".person_id = 6 ) LIMIT 1